[
  "My grandma can type faster than that—and she's been dead for ten years.",
  "A one-fingered toddler could beat that speed without spilling his juice.",
  "My dog just walked across the keyboard and got a better score.",
  "Even my cat types faster when she's trying to order treats online.",
  "That speed? My grandpa hunts and pecks faster with his arthritis.",
  "A drunk guy texting at 2 AM types faster and with fewer mistakes.",
  "My mom on her old flip phone from 2005 beats that easily.",
  "Even the hunt-and-peck guy at work laps you without trying.",
  "A sleepy sloth on a broken keyboard could do better than this.",
  "My 90-year-old neighbor types emails faster on her ancient PC.",
  "That pace is slower than my dad figuring out emojis.",
  "A T-Rex with tiny arms would smash out more words per minute.",
  "Even I type faster with my elbows—and I'm not even looking.",
  "My little sister on her tablet games types circles around you.",
  "A hamster running on a wheel generates more words than that.",
  "That speed makes my grandma's knitting look like a blur.",
  "Even autocorrect gave up waiting for you to finish a word.",
  "My dad trying to text 'OK' takes less time than your whole test.",
  "A blindfolded monkey mashing keys gets a higher score.",
  "That typing is slower than my grandpa reading the newspaper.",
  "Even the guy who texts with one thumb in traffic beats you.",
  "My grandma's rotary phone dials faster than you type.",
  "A toddler smashing the screen types more accurately.",
  "That speed? My cat's random paw walks produce better results.",
  "Even my uncle who still uses AOL types faster than this.",
  "A sloth on vacation could finish a sentence quicker.",
  "My mom forwarding chain emails does it with more speed.",
  "That pace is slower than dial-up internet loading a page.",
  "Even a chicken pecking at grains types more words.",
  "My grandpa telling a story gets to the point faster.",
  "A drunk friend voice-to-texting makes fewer errors and faster.",
  "That typing speed loses to my grandma baking cookies from scratch.",
  "Even the slowest kid in typing class smokes this score.",
  "My cat knocking stuff off the desk types faster accidentally.",
  "A one-armed bandit slot machine pulls faster than you type.",
  "That speed makes my dad's golf swing look lightning quick.",
  "Even my phone's predictive text finishes sentences faster.",
  "A turtle crossing the road beats your words per minute.",
  "My grandma handwriting letters is faster and neater.",
  "That pace? Even paint drying finishes before you do.",
  "A sleepy baby mashing keys in their sleep does better.",
  "Even my uncle hunting for keys one by one wins easily.",
  "That typing is slower than my mom wrapping Christmas presents.",
  "A goldfish in a bowl swims laps faster than you type.",
  "My dad setting up the TV remote moves quicker.",
  "Even a broken typewriter jams less than this performance.",
  "That speed loses to my grandma's crossword puzzle pace.",
  "A snail mailing a letter gets there faster than your text.",
  "My little cousin on Roblox chat types way faster.",
  "Even the class slacker copying homework finishes quicker.",
  "That typing makes my grandpa's fishing stories seem short.",
  "A penguin waddling across ice moves with more urgency.",
  "My mom scrolling Facebook types comments faster than this.",
  "Even a zombie from a movie shuffles quicker to brains.",
  "That speed? My cat chasing a laser pointer laps you.",
  "A glacier melting moves faster than your fingers.",
  "My uncle grilling burgers flips them with more speed.",
  "Even dial-up connecting in the 90s was less painful.",
  "That typing is slower than my dad assembling IKEA furniture.",
  "A sloth hanging upside down types right-side up faster.",
  "My grandma's bingo calling is quicker and more accurate.",
  "Even a kid learning ABCs pecks faster than this mess.",
  "That pace makes traffic jams look like racetracks.",
  "A tortoise winning the race against the hare beats you.",
  "My mom planting flowers in the garden finishes rows faster.",
  "Even my phone on low battery responds quicker.",
  "That speed loses to my grandpa sharpening his pencil.",
  "A caterpillar turning into a butterfly evolves faster.",
  "My cat licking its paw cleans up quicker than your errors.",
  "Even waiting for water to boil is more exciting.",
  "That typing is slower than my uncle's bad jokes landing.",
  "A tree growing rings annually produces more than this.",
  "My grandma's rocking chair rocks with more rhythm.",
  "Even a vending machine dispensing snacks is faster.",
  "That speed? My dog fetching a stick returns quicker.",
  "A hourglass running out of sand times better.",
  "My mom knitting a scarf finishes patterns faster.",
  "Even continental drift moves land quicker than your words.",
  "That typing makes my dad's naps seem action-packed.",
  "A sundial telling time is more accurate and speedy.",
  "My little brother building Lego sets assembles faster.",
  "Even rust forming on metal happens quicker.",
  "That pace is slower than my grandma's gossip spreading.",
  "A watched pot boiling finally happens before you finish.",
  "My uncle fishing waits less time for a bite.",
  "Even bread rising in the oven expands faster.",
  "That speed loses to my cat's nine lives flashing by.",
  "A calendar page turning months passes quicker.",
  "My grandma preserving jams cans more words.",
  "Even ice melting in a drink refreshes faster than this.",
  "That typing is slower than seasons changing."
]